{
    "content": "<div><figure class=\"article-figure\"><div class=\"img-wrap\"><picture><source media=\"(min-width: 376px)\"><source media=\"(max-width: 375px)\"><img class=\"null lazyload\"></source></source></picture></div><figcaption class=\"photoCaption\">Texas A&amp;M was down 69-57 in the final half-minute of regulation. Two overtime periods later, the Aggies were in the Sweet 16.&#xA0;<cite>Mark D. Smith/USA TODAY Sports</cite></figcaption></figure><div class=\"article-body\"><p>Texas A&amp;M&#x2019;s win over Northern Iowa on Sunday featured the largest comeback in the final minute of a game in Division I history.</p><p>The Aggies needed a 14-2 run in the final 44 seconds of regulation to send the game to overtime, where they would eventually win.</p><p>The win might be the most improbable and impressive come-from-behind victory in basketball in the past 25 years. Here is a look at some of the notable comebacks across men&#x2019;s college basketball and the NBA over that time.</p><p><strong>May 7, 1995 &#x2013; Eastern Conference semifinals (Pacers-Knicks)</strong></p><p>In Game 1 of the 1995 Eastern Conference semifinals, Reggie Miller scored eight points in 8.9 seconds in the signature moment of his Hall of Fame career. The Pacers would outlast the Knicks in the series, winning in seven games.</p><p><strong>March 31, 2001 &#x2013; Final Four (Duke-Maryland)</strong></p><p>Duke already had an impressive comeback against Maryland earlier in the 2000-01 season, and the Blue Devils put together another improbable one in the Final Four. They trailed by 22 early in the first half and by 11 at the break. Duke erased both deficits, which were Final Four records. The Blue Devils went on to win the national title that season.</p><p><strong>December 9, 2004 &#x2013; NBA regular season (Spurs-Rockets)</strong></p><p>Tracy McGrady scored 13 points in the final 35 seconds of the Rockets&#x2019; win over the Spurs. The Spurs led by eight points before McGrady went on his run.</p><p><strong>March 26, 2005 &#x2013; Elite Eight (Arizona&#x2013;Illinois)</strong></p><p>Illinois trailed by 15 points with four minutes remaining and by eight with less than one minute to go. Illinois came back to win by one in overtime. They made it to the Final Four but lost to North Carolina in the title game that season.</p><p><strong>June 12, 2008 &#x2013; NBA Finals Game 4 (Celtics-Lakers)</strong></p><p>The Celtics rallied from a 24-point deficit and beat the Lakers by six. Boston went on to win the series in six games, the Celtics&#x2019; 17th championship and first since 1986.</p><p><strong>April 29, 2012 &#x2013; NBA first-round Game 1 (Clippers-Grizzlies)</strong></p><p>The Clippers trailed the Grizzlies by 21 entering the fourth quarter. Los Angeles outscored Memphis by 22 in the fourth quarter in a 99-98 win.</p><p><strong>March 13, 2012 - NCAA First Four (BYU-Iona)</strong></p><p>BYU rallied from 25 points down to beat Iona by six. It was the largest comeback in an NCAA tournament game.</p><p><strong>March 20, 2016 &#x2013; NCAA second round (Northern Iowa-Texas A&amp;M)</strong></p><p>Texas A&amp;M was down by 12 points with as little as 35 seconds remaining in regulation. They forced four Northern Iowa turnovers to chip away at the deficit. It culminated when Northern Iowa&#x2019;s Wes Washpun was stuck in the corner with no timeouts. Admon Gilder stole the ball and drove for the game-tying layup with 1.9 seconds left. Danuel House sunk a free throw with less than 13 seconds remaining in the second overtime to give the Aggies a four-point victory.</p>\n</div></div>",
    "domain": "espn.go.com",
    "author": null,
    "url": "http://espn.go.com/blog/statsinfo/post/_/id/115410/how-ams-big-comeback-compares-to-others",
    "short_url": "http://rdd.me/p38cieft",
    "title": "How A&M;'s big comeback compares to others",
    "excerpt": "Texas A&amp;M was down 69-57 in the final half-minute of regulation. Two overtime periods later, the Aggies were in the Sweet 16.&#xA0;Mark D. Smith/USA TODAY SportsTexas A&amp;M&#x2019;s win over&hellip;",
    "direction": "ltr",
    "word_count": 492,
    "total_pages": 0,
    "next_page_id": null,
    "dek": null,
    "lead_image_url": null,
    "rendered_pages": 1,
    "date_published": "2016-03-21 18:02:42"
}